---
kind: other
id: Methods.T:Autodesk.Revit.UI.Macros.UIMacroManager
source: html/29e73b11-61f6-bed4-a6ee-9bb20372505e.htm
---
# UIMacroManager Methods

Adds a MacroModule to the application or document.